QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
/*  
 * ======== main.c ========
 * H4 Example
 *
 * Packet Protocol Demo:
 *
 * This application emulates a simple packet protocol that receives packets 
 * like the following:
 * Establish a connection with the HID Demo App.  No text is initially 
 * displayed.  Send a single digit, a number between 1-9.  Then, send that 
 * number of bytes.  For example, send '3', and then send "abc".  The 
 * application responds by indicating it has received the packet, and waits for 
 * another.
 * ----------------------------------------------------------------------------+
 * Please refer to the Examples Guide for more details.
 *----------------------------------------------------------------------------*/
#include <string.h>
#include <math.h>

#include "driverlib.h"

#include "USB_config/descriptors.h"
#include "USB_API/USB_Common/device.h"
#include "USB_API/USB_Common/usb.h"                 // USB-specific functions
#include "USB_API/USB_HID_API/UsbHid.h"
#include "USB_app/usbConstructs.h"

#include "hal.h"

#include "fifo.h"

#define UART 		USCI_A1_BASE
#define TIMER 		TIMER_A0_BASE
#define ADC         ADC12_A_BASE
#define REF         REF_BASE
#define SPI 		USCI_A1_BASE



#define MODE_DC 	0
#define MODE_RMS 	1

#define SR_2P5  0
#define SR_1k   1
#define SR_30k  2

uint8_t DcSampleRate;

uint8_t Mode;

#define  RMS_SAMPLES 16384
int64_t  RmsAccum;
uint16_t RmsSample;
uint8_t  RmsBusy;

volatile uint16_t LastAdcReading;

// Forward Declarations
uint32_t GetSysTime();
void DelayUS(uint16_t delayUS);
void Delay(uint32_t delayMS);
void ProcessUsbData();
void SetADS1256SampleRate(uint8_t);
void ResetQA350();

// Global flags set by events
volatile uint8_t bDataReceiveCompleted_event = FALSE;  // data receive completed event
volatile uint8_t bSampleReady_event = FALSE;

// Application globals
uint16_t x,y;

// USB return buffer is 48 bytes. It can be a little larger, but
// the HID protocol TI uses for a pipe has some overhead itself.
// An ADC word is 24 bits, and the upper 8 bits are used for housekeeping
// so this means we can hold 12 32-bit samples per HID read
#define USB_BUF_LEN 48
uint8_t UsbBuffer[USB_BUF_LEN];

// This is updated at 1mS rate. This keeps track of the number of milliseconds elapsed since
// system boot
volatile uint32_t SysTicks;

volatile uint16_t LEDConnected;  // Kicked by PC application at least once per second to keep LED lit
volatile uint8_t LEDCommand;     // Toggled for 50 mS upon receipt of command from the PC

int8_t IntRefCount;

void EIntRefCounted()
{
	if (IntRefCount > 0)
		--IntRefCount;

	if (IntRefCount == 0)
		__enable_interrupt();
}

void DIntRefCounted()
{
	if (IntRefCount < 126)
		++IntRefCount;

	if (IntRefCount == 1)
		__disable_interrupt();
}

void InitClocks()
{
    // Set system freqs as follows:
    // DCOCLK: 24 MHz
    // MCLK (Master Clock): 24 MHz
    // SMCLCK (Subsystem Master Clock): 24 MHz
    // ACLK (Aux Clock): 24 MHz

    // For clock settings below, see Fig 5.1 in http://www.ti.com/lit/ug/slau208n/slau208n.pdf
    // FLL reference clock is REFOCLK

    // Good link on setting MSP430F5529 clocks here: http://mostlyanalog.blogspot.com/2015/04/clocking-msp430f5529-launchpad.html

    // XT2 IO pins to drive the xtal
	GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P5, GPIO_PIN2);
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P5, GPIO_PIN3);

	// Turn on xtal drive
	UCS_XT2Start(UCS_XT2DRIVE_4MHZ_8MHZ);

	// XT1 defaults to 32KHz, and we're using 4 MHz resonator for XT2. Note, though
	// we don't have an xtal in place for 32 KHz
	UCS_setExternalClockSource(32768, 4000000);

	// Into FLL with 1 MHz reference
	UCS_clockSignalInit(UCS_FLLREF, UCS_XT2CLK_SELECT, UCS_CLOCK_DIVIDER_4 );
	// Out of FLL with 24X multiplier to 24 MHz. Note we specify KHz in first arg.
	// This gives us a DCO frequency of 24 MHz
	UCS_initFLLSettle(24000, 24);

	// Set all system clocks to run at the DCO frequency of 24 MHz
	UCS_clockSignalInit(UCS_ACLK, UCS_DCOCLK_SELECT, UCS_CLOCK_DIVIDER_1 );
	UCS_clockSignalInit(UCS_MCLK, UCS_DCOCLK_SELECT, UCS_CLOCK_DIVIDER_1 );
	UCS_clockSignalInit(UCS_SMCLK, UCS_DCOCLK_SELECT, UCS_CLOCK_DIVIDER_1 );
}


// ADS1256 Primitives
#define IS_DATAREADY   (~P2IN & 0x20)
//#define ASSERT_SYNC    (P5OUT = P5IN & ~0x40)
//#define DEASSERT_SYNC  (P5OUT = P5IN | 0x40)
//#define ASSERT_CS      (P4OUT = P4IN & ~0x40)
//#define DEASSERT_CS    (P4OUT = P4IN & ~0x40)
//#define ASSERT_RESET   (P4OUT = P4IN & ~0x80)
//#define DEASSERT_RESET (P4OUT = P4IN | 0x80)

void InitGPIO()
{
	// Top LED
	GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN3 | GPIO_PIN2 | GPIO_PIN1);
	P1OUT |= 0x07;

	// Set P1.0 as ACLK output
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P1, GPIO_PIN0);

	// ADS1256 DRDY Input pin is P2.5 and P5.7 (P5.7 on old board). When low, it indicates that data is ready.
	// Older boards used P5.7, but that pin didn't have an interrupt and must be modified
	// to route the DRDY signal to P2.5. On new boards, P5.7 can be disconnected completely
	GPIO_setAsInputPin(GPIO_PORT_P2, GPIO_PIN5);
	GPIO_interruptEdgeSelect(GPIO_PORT_P2, GPIO_PIN5, GPIO_HIGH_TO_LOW_TRANSITION);


