QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
	// ADS1256 SYNC
	//GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN6);

	// ADS1256 RESET
	//GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN7);

	// ADS1256 CS
	//GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN6);

	// ADS1256 DOUT == MSP430 SPI DIN
	GPIO_setAsInputPin(GPIO_PORT_P4, GPIO_PIN5);
	GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN5);    // Controlled by SPI HW

	// ADS1256 DIN == MSP430 DOUT
	GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN4);
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P4, GPIO_PIN4);   // Controlled by SPI HW

	// ADS1256 CLOCK
	GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN0);
	GPIO_setAsPeripheralModuleFunctionOutputPin(GPIO_PORT_P4, GPIO_PIN0);	// Controlled by SPI HW
}


//
// Init TimerA to generate an interrupt at 1 KHz
//
void InitTimerA()
{
    // Setup Timer A to generate an interrupt at 1 KHz
	Timer_A_initUpModeParam  tp;
	tp.captureCompareInterruptEnable_CCR0_CCIE = TIMER_A_CCIE_CCR0_INTERRUPT_ENABLE;
    tp.clockSource = TIMER_A_CLOCKSOURCE_ACLK;
    tp.clockSourceDivider = TIMER_A_CLOCKSOURCE_DIVIDER_64; // This is 24 MHz / 64 = 375 KHz
    tp.startTimer = true;
    tp.timerClear = TIMER_A_DO_CLEAR;
    tp.timerInterruptEnable_TAIE = TIMER_A_TAIE_INTERRUPT_DISABLE;
    tp.timerPeriod = 375;  // Divide 375K by 375 to get 1mS interrupt rate
    Timer_A_initUpMode(TIMER, &tp);
}

//
// SPI communication with ADS ADC. We'll run at 2.5 MHz. Max for ADS1256 is 2.5 MHz
// (see figure 1 in spec, where t2l + t2h = 400 nS = 2.5 MHz
//
void InitSPI()
{
	USCI_A_SPI_initMasterParam param;
	param.selectClockSource = USCI_A_SPI_CLOCKSOURCE_ACLK;
	param.clockSourceFrequency = UCS_getACLK();
	param.desiredSpiClock = 2500000;
	param.msbFirst = USCI_A_SPI_MSB_FIRST;
	param.clockPhase = USCI_A_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT; // Latch on falling
	param.clockPolarity = USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW;
	//param.spiMode = USCI_A_SPI_3PIN;
	USCI_A_SPI_initMaster(SPI, &param);
	USCI_A_SPI_enable(SPI);
}

void InitAdc()
{
    // Use internal ADC clock
    ADC12_A_init(ADC, ADC12_A_SAMPLEHOLDSOURCE_SC, ADC12_A_CLOCKSOURCE_ADC12OSC, ADC12_A_CLOCKDIVIDER_1);
    ADC12_A_enable(ADC);

    // Set ADC sample rate to about 18 KHz = 55uS
    ADC12_A_setupSamplingTimer(ADC, ADC12_A_CYCLEHOLD_256_CYCLES, ADC12_A_CYCLEHOLD_256_CYCLES, ADC12_A_MULTIPLESAMPLESENABLE);

    ADC12_A_configureMemoryParam param = {0};
	param.memoryBufferControlIndex = ADC12_A_MEMORY_0;
	param.inputSourceSelect = ADC12_A_INPUT_TEMPSENSOR;
	param.positiveRefVoltageSourceSelect = ADC12_A_VREFPOS_INT;
	param.negativeRefVoltageSourceSelect = ADC12_A_VREFNEG_AVSS;
	param.endOfSequence = ADC12_A_NOTENDOFSEQUENCE;
	ADC12_A_configureMemory(ADC, &param);

	while ( REF_ACTIVE == Ref_isRefGenBusy(REF) ) ;

    Ref_setReferenceVoltage(REF, REF_VREF1_5V);
    Ref_enableReferenceVoltage(REF);

    // Wait for ref to settle
    __delay_cycles(75);

	ADC12_A_clearInterrupt(ADC, ADC12IFG0);
    ADC12_A_enableInterrupt(ADC, ADC12IE0);

    ADC12_A_startConversion(ADC, ADC12_A_MEMORY_0, ADC12_A_REPEATED_SINGLECHANNEL);
}

int16_t AdcGetTemp()
{
	int32_t raw;

	__disable_interrupt();
	raw = (uint16_t)LastAdcReading;
	__enable_interrupt();

	int32_t calAdcT30 = *(uint16_t*)(0x01A1A); // ADC 1.5V reference at 30C
	int32_t calAdcT85 = *(uint16_t*)(0x01A1C); // ADC 1.5V reference at 85C

	// See 1.13.5.3 in users manual. This will return temp * 10 (eg 25.3 degrees = 253)
	int32_t result = (raw - calAdcT30) * 550 / (calAdcT85 - calAdcT30) + 300;

	return result;
}

//
// Send a 32-bit word via SPI
//
/*
uint32_t SendSPI(uint32_t data)
{
	uint32_t r = 0;

	USCI_A_SPI_transmitData(SPI, data >> 24);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 16);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 8);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, data >> 0);
	r = (r << 8) + USCI_A_SPI_receiveData(SPI);

	return r;
}
*/

// ADS1256 data notes:
// Input clock is 7.68 MHz == 130 nS
// Max sclock is 1.92 MHz
// Issuing data read to clocking out data is 6.56 uS
// Aim for 50 or 60 SPS. This is Fdata, and tau data is thus 20 mS
// The max SCLK is 10*20 mS or 200 mS
// Data should be latched on falling edge of SCLK
//

//
// Write to ADS register
//
void WriteADS1256Reg(uint8_t reg, uint8_t val)
{
	reg &= 0x0F;  // Mask register
	reg |= 0x50;  // Command

	USCI_A_SPI_transmitData(SPI, reg);   // This is the 1st command byte
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	USCI_A_SPI_transmitData(SPI, 0);     // This is the number of bytes to write MINUS 1
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	USCI_A_SPI_transmitData(SPI, val);   // Run the clock for 8 more cycles to write the byte
	while (USCI_A_SPI_isBusy(SPI));
	USCI_A_SPI_receiveData(SPI);         // Junk read
}

//
// Read from ADS register
//
uint8_t ReadADS1256Reg(uint8_t reg)
{
	reg &= 0x0F;  // Mask register
	reg |= 0x10;  // Command

	USCI_A_SPI_transmitData(SPI, reg);   // This is the 1st command byte
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	USCI_A_SPI_transmitData(SPI, 0);     // This is the number of bytes to read MINUS 1
	while (USCI_A_SPI_isBusy(SPI));
    USCI_A_SPI_receiveData(SPI);         // Junk read

	DelayUS(5);						// This is t6 in spec (6.5uS is the min). See Fig1 and Fig 30

	USCI_A_SPI_transmitData(SPI, 0);    // Run the clock for 8 more cycles to grab the byte
	while (USCI_A_SPI_isBusy(SPI));

	return USCI_A_SPI_receiveData(SPI);
}

//
// Read data from ADS. This will block until the part is ready. If the part never
// becomes ready, then this will hang
//
int32_t ReadADS1256Data()
{
	uint32_t data = 0;

	// SPIN while DREADY bit is high (indicating it is NOT ready)
	while (IS_DATAREADY == 0)
		;

	USCI_A_SPI_transmitData(SPI, 0x01);  // Send first command byte (command + addr)
	while (USCI_A_SPI_isBusy(SPI));
	USCI_A_SPI_receiveData(SPI);         // Junk read

	// Delay t6 (see spec: at least 6.5us) to wait for response
	DelayUS(5);

