QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	USCI_A_SPI_transmitData(SPI, 0x00);
	while (USCI_A_SPI_isBusy(SPI));
	data = (data << 8) + USCI_A_SPI_receiveData(SPI);

	// Sign extend to full 32 bits
	if ( (data & 0x00800000) > 0)
	{
		data += 0xFF000000;
	}

	return data;
}

// Issues SYNC command. Forces sampling to re-start, which will
// also cause DRDY to go high. This needs to be called whenever
// mux is changed, or pga is changed, or sample rate is changed,
// etc
void SyncADS1256()
{
	// See figure 36 in spec
	USCI_A_SPI_transmitData(SPI, 0xFC);  // Sync command
	DelayUS(10);                         // See t11 in spec. This is 3.1uS minimum
	USCI_A_SPI_transmitData(SPI, 0x00);  // Wakeup command

}


void ResetADS1256()
{
	uint8_t i;

	// Reset part. We don't have a CS, so if the comm gets out of sync with
	// the part, then the SPI bus will require 32 DRDY periods to reset. At
	// the slow sample rate, this is 12.8 seconds. So it's very important
	// to ensure SPI communications never get out of sync. But if they do
	// this will try 8 times to reset, hopefully overcoming any sync issue
	//
	// Upon reset we'll revert to 30K sample rate. And then we must
	// wait 32 cycles for the SPI bus to clear. This is 32 * 33uS = 1mS
	for (i=0; i<8; i++)
	{
		USCI_A_SPI_transmitData(SPI, 0xFE);
		DelayUS(50);
	}

	DelayUS(5000);
}

//
// Spins until ADS is ready
//
void WaitUntilDataReady()
{
	while (IS_DATAREADY == 0)
		;
}

//
// Set ADS PGA Level
void SetADS1256PGA(int pga)
{
	pga &= 0x7;
	WriteADS1256Reg(2, pga);
	SyncADS1256();
}

// Atten Level 0 = inputs 0/1 with D3 set high (atten SSR closed)
// Atten Level 1 = inputs 2/3 with D3 set low (atten SSR open)
void SetADS1256Atten(int attenLevel)
{
	switch (attenLevel)
	{
		case 0:
			WriteADS1256Reg(1, 0x01); WriteADS1256Reg(4, 0x78);
			break;
		case 1:
			WriteADS1256Reg(1, 0x23); WriteADS1256Reg(4, 0x70);
			break;
		default:
			while (1);



	}

	SyncADS1256();

}

void ADS1256SelfCal()
{
	    USCI_A_SPI_transmitData(SPI, 0xF0);  // Single write of 0xF0 does selfcal
		while (USCI_A_SPI_isBusy(SPI));
	    USCI_A_SPI_receiveData(SPI);         // Junk read
}

void InitADS1256()
{
	DelayUS(1000);

	WriteADS1256Reg(0, 0x6);  // Enable buffer and enable auto cal
	SyncADS1256();

	SetADS1256Atten(0);       // Select inputs 3/4. This will issue sync

	WriteADS1256Reg(2, 0);    // CLKout off, sensor detect off, PGA = 1
	SyncADS1256();

	DcSampleRate = SR_1k;
	SetADS1256SampleRate(SR_1k);
	SyncADS1256();
}

//
// Sample rate of 0 is slow, and 1 is fast
//
void SetADS1256SampleRate(uint8_t sampleRate)
{
	if (sampleRate == SR_2P5)
	{
		// Sample slow, 400mS sample period
		WriteADS1256Reg(3, 0x3); // Set to 2.5 SPS
	}
	else if (sampleRate == SR_1k)
	{
		// Sample fast, 1 mS period
		WriteADS1256Reg(3, 0xA1); // Set to 1000 sps
	}
	else if (sampleRate == SR_30k)
	{
		// RMS mode, set to 30,000 SPS
		WriteADS1256Reg(3, 0xE0);

		// 7500 sps
		//WriteADS1256Reg(3, 0xD0);
	}

	SyncADS1256();
}

//
// Cycle through the LEDs to indicate to the user  we've turned on.
// This is self-time, no other timing resources needed
//
void SweepLED()
{
	volatile uint32_t i, j;
	volatile uint32_t delayVal = 30000;

	 // All LED off
	P1OUT &= ~(BIT3 | BIT2 | BIT1);

	// Sweep LEDs
	for (i=0; i<10; i++)
	{
		P1OUT |= BIT3;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);

		P1OUT |= BIT2;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);

		P1OUT |= BIT1;
		for (j=0; j<delayVal; j++);
		P1OUT &= ~(BIT3 | BIT2 | BIT1);
	}
}

void SetMode(uint8_t mode)
{
	Mode = mode;

	if (mode == MODE_DC)
	{
		Mode = MODE_DC;
		SetADS1256SampleRate(DcSampleRate);
	}
	else if (mode == MODE_RMS)
	{
		Mode = MODE_RMS;
		//SetADS1256SampleRate(SR_30k);
		//RmsAccum = 0;
		//RmsSample = 0;
		//RmsBusy = 1;
	}
}

/*  
 * ======== main ========
 */
void main (void)
{
    WDT_A_hold(WDT_A_BASE); // Stop watchdog timer

    // Minimum Vcore setting required for the USB API is PMM_CORE_LEVEL_2 .
    PMM_setVCore(PMM_CORE_LEVEL_2);

    __disable_interrupt();

    InitGPIO();
    InitClocks();

    // Indicate we've booted
    SweepLED();

    InitSPI();
    InitTimerA();
    InitAdc();

    // At this point, interrupts must be enabled as the
    // routines immediately following rely on them for timing
    __enable_interrupt();  // Enable interrupts globally

    ResetADS1256();
    DelayUS(5000);           // Safe number
    InitADS1256();
    DelayUS(5000);           // Safe number
    DcSampleRate = SR_2P5;
    SetADS1256SampleRate(SR_2P5); // Set slow sample rate to match UI default

    USB_setup(TRUE, TRUE); // Init USB & events; if a host is present, connect

    ResetQA350();

    // Enable DRDY interrupt handling.
	GPIO_enableInterrupt(GPIO_PORT_P2, GPIO_PIN5);

    while (1)
    {
        // Check the USB state and directly main loop accordingly
        switch (USB_connectionState())
        {
            // This case is executed while your device is enumerated on the
            // USB host
            case ST_ENUM_ACTIVE:

            	// Only open it if we haven't already done so
				if (!(USBHID_intfStatus(HID0_INTFNUM, &x, &y) & kUSBHID_waitingForReceive))
				{
					// Start a receive operation. Everything arrives as 2 byte packets.
					if (USBHID_receiveData(UsbBuffer, 2, HID0_INTFNUM) == kUSBHID_busNotAvailable)
					{
						// Abort receive is BUS is not available
						USBHID_abortReceive(&x,HID0_INTFNUM);
						break;
					}
					else
					{
						// The bus was available and we're waiting to receive

