QuantAsylum/QA350/MSP430 Workspace/QA350/main.c
					}
				}
				else
				{
					// Here, we are already waiting for receive. Do nothing.
				}


                // Wait in LPM0 until a receive operation has completed
                __bis_SR_register(LPM0_bits + GIE);

                if (bDataReceiveCompleted_event)
                {
                    bDataReceiveCompleted_event = FALSE;
                    ProcessUsbData();
                }

                if (bSampleReady_event)
                {
                	bSampleReady_event = FALSE;
                	volatile int32_t data = ReadADS1256Data();

					if (Mode == MODE_DC)
					{
						FifoPush(data);
					}
					else if (Mode == MODE_RMS)
					{
						if (RmsSample < RMS_SAMPLES)
						{
							++RmsSample;

							data = data >> 4;

							RmsAccum += ((int64_t)data * (int64_t)data);
						}
						else
						{
							// Done
							RmsBusy = false;
						}
					}
					else
					{
						// Unknown mode
						while (1);
					}
                }

                break;

            // These cases are executed while your device is disconnected from
            // the host (meaning, not enumerated); enumerated but suspended
            // by the host, or connected to a powered hub without a USB host
            // present.
            case ST_PHYS_DISCONNECTED:
            case ST_ENUM_SUSPENDED:
            case ST_PHYS_CONNECTED_NOENUM_SUSP:
                __bis_SR_register(LPM3_bits + GIE);
                _NOP();
                break;

            // The default is executed for the momentary state
            // ST_ENUM_IN_PROGRESS.  Usually, this state only last a few
            // seconds.  Be sure not to enter LPM3 in this state; USB
            // communication is taking place here, and therefore the mode must
            // be LPM0 or active-CPU.
            case ST_ENUM_IN_PROGRESS:
            default:;
        }

    }  //while(1)
} //main()

//
// Called from the main loop above. this handles all the USB command processing
//
void ProcessUsbData()
{
	uint8_t i;
    uint32_t data;

	// Here, data was received. The first byte is the command
	switch (UsbBuffer[0])
	{
		case 0:
			// This is a kick command. Light the LED for another 1000 mS
			LEDConnected = 1000;  	// 1 second timeout
			break;

		case 1:
			// Read last ADC reading. This won't disturb the fifo. If not in DC
			// mode, this will intentionally hang
			LEDCommand = 100; 		// 100 mS flash

			if (Mode != MODE_DC)
			{
				while (1)
				{
					LEDCommand = 100;
				}
			}

			data = FifoPeekLastPushed();

			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 2:
			// Set PGA
			SetADS1256PGA(UsbBuffer[1]);
			break;

		case 3:
			// Set attentuator
			SetADS1256Atten(UsbBuffer[1]);
			break;

		case 4:
			// Stream data. Grab 12 words / 48 bytes from the FIFO. If not used in
			// DC mode, this will intentionally hang the device
			LEDCommand = 100; 		// 100 mS flash

			if (Mode != MODE_DC)
			{
				while (1)
				{
					LEDCommand = 100;
				}
			}

			for (i=0; i<48; i+=4)
			{
				data = FifoPop();
				UsbBuffer[i+0] = data >> 24;
				UsbBuffer[i+1] = data >> 16;
				UsbBuffer[i+2] = data >> 8;
				UsbBuffer[i+3] = data >> 0;
			}

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		case 5:
			// Query fifo count. If more than 12, then host can pull a full buffer. This
			// can be done in any mode, but doesn't make sense unless you are in DC mode
			data = FifoCount();
			UsbBuffer[0] = data >> 24;
			UsbBuffer[1] = data >> 16;
			UsbBuffer[2] = data >> 8;
			UsbBuffer[3] = data >> 0;

			if (hidSendDataInBackground( UsbBuffer, USB_BUF_LEN, HID0_INTFNUM,0))
			{
				// Operation may still be open; cancel it if the
				// send fails, escape the main loop
				USBHID_abortSend(&x,HID0_INTFNUM);
				break;
			}
			else
			{
				// Send was successful

			}
			break;

		// Sets DC sample rate, either 2.5SPS or 1K sps. May be called
	    // while in DC or RMS mode, but will only change settings
		// immediately if in DC mode.
		case 6:
			DcSampleRate = UsbBuffer[1];
			if (Mode == MODE_DC)
				SetADS1256SampleRate(DcSampleRate);
			FifoClear();
			break;

		// Set mode of operation, either DC or RMS
		case 12:
			if (Mode == MODE_DC)
				SetADS1256SampleRate(DcSampleRate);

			SetMode(UsbBuffer[1]);

			FifoClear();
			break;

		// Start RMS sample. If not in RMS mode, this will
		// intentionally hang
		case 13:
			LEDCommand = 100; 		// 100 mS flash

			if (Mode != MODE_RMS)
			{
				while (1)
				{
					LEDCommand = 100;
				}
			}

			RmsAccum = 0;
			RmsSample = 0;
			RmsBusy = 1;
			SetADS1256SampleRate(SR_30k);
			break;

		// Retrieve RMS reading. If not in RMS mode, this
		// will intentionally hang
		case 14:
			LEDCommand = 100; 		// 100 mS flash

			if (Mode != MODE_RMS)
			{
				while (1)
				{
					LEDCommand = 100;
				}
			}

			if (RmsBusy)
			{
				UsbBuffer[0] = (uint8_t)(INVALID_RESULT >> 24);
				UsbBuffer[1] = (uint8_t)(INVALID_RESULT >> 16);
				UsbBuffer[2] = (uint8_t)(INVALID_RESULT >> 8);
				UsbBuffer[3] = (uint8_t)(INVALID_RESULT >> 0);
			}
			else
			{
				RmsAccum = RmsAccum / (int64_t)RMS_SAMPLES;
			    uint32_t result = (int32_t)sqrtl(RmsAccum);

			    result = result << 4;

				UsbBuffer[0] = result >> 24;
				UsbBuffer[1] = result >> 16;
				UsbBuffer[2] = result >> 8;
				UsbBuffer[3] = result >> 0;
			}

